tests/data/systech/sscc_sequential_number_request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Header/>
    <soapenv:Body>
        <ain:NumberRangeRequestMessage xmlns:ain="http://sap.com/xi/AIN">
            <SendingSystem>Systech</SendingSystem>
            <IDType>GS1_SER</IDType>
            <EncodingType>SSCC</EncodingType>
            <Size>50</Size>
            <ObjectKey>
                <Name>GCP</Name>
                <Value>00355555</Value>
            </ObjectKey>
            <RequestRandomizedNumbers/>
        </ain:NumberRangeRequestMessage>
    </soapenv:Body>
</soapenv:Envelope>
